package com.MyFi.MyFridge;

public class AutoCompleteText {

    private String[] ingredientList = new String[]{
            "가쓰오부시","가지","갈치","감자","계란","고구마","고등어","고사리",
            "굴소스","김치","깍두기","꽁치","꽈리고추","느타리버섯","닭고기","닭고기(날개)",
            "닭고기(봉)","당면","대하","돼지고기","된장","두부","떡","마요네즈","만두","무",
            "미역","밀가루","바지락","버터","베이컨","부추","부침가루","사골육수","상추",
            "소시지","쇠고기","쇠고기(차돌박이)","숙주","순두부","스파게티면","스팸",
            "애호박","양송이버섯","양파","어묵","오리고기","오이","오징어","우유",
            "인삼","참치캔","찹쌀","청국장","치즈","카레","칵테일새우","캔옥수수",
            "콩나물","토마토","토마토소스","통마늘","간장","고추","고추가루","고추장",
            "고춧가루","김","깻잎","꿀","다시마","다진마늘","당근","대추","대파","마늘",
            "마른멸치","맛술","머스타드소스","레몬즙","물엿","미나리","버섯","브로콜리",
            "새우","새우젓","생강","설탕","소금","올리고당","쪽파","참기름","케첩","통깨",
            "생크림","파프리카","표고버섯","피망","황기","후추","두반장","마늘종","튀김가루",
            "돈까스소스","깨소금","매실청","건새우","라면","양배추","새송이버섯","식초","들기름","쌈장"
    };

    public String[] getIngredientList(){
        return this.ingredientList;
    }
}
